#include <iostream>
#include <clocale>
using namespace std;

int main() {
    int n, m;
    cout << "Введите n, m: ";
    cin >> n >> m;
    cout << endl << "Первое выражение: n++ - m" << endl;
    cout << "Результат: " << n++ - m << endl; /* сначала вычитание старого значения m из старого значения n,
    затем увеличение n на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n увеличивается на 1, m не изменяется
    cout << endl << "Второе выражение: m-- > n" << endl;
    cout << "Результат: " << (m-- > n) << endl; /* сначала сравнение старого значения m с текущим n,
    затем уменьшение m на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n не изменяется, m уменьшается на 1
    cout << endl << "Третье выражение: n-- > m" << endl;
    cout << "Результат: " << (n-- > m) << endl; /* сначала сравнение старого значения n с текущим m,
    затем уменьшение n на 1 */
    cout << "n = " << n << ", m = " << m << endl; // n уменьшается на 1, m не изменяется

    return 0;
}
